<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Maxon Cinema 4D.</string>
	<key>Identifier</key>
	<string>com.github.hovedkvarteret.download.MaxonCinema4D</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Maxon Cinema 4D Full Installer</string>
		<key>NAME</key>
		<string>Maxon Cinema 4D</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>url</key>
			<string>https://www.maxon.net/en/downloads/cinema-4d-r23-downloads</string>
			<key>re_pattern</key>
			<string>href="(/_nuxt/static/\d+/en/downloads/cinema-4d-r23-downloads/payload\.js)"</string>
			<key>result_output_var_name</key>
			<string>payloadjs</string>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>url</key>
			<string>https://www.maxon.net%payloadjs%</string>
			<key>re_pattern</key>
			<string>(https:\\u002F\\u002Finstaller\.maxon\.net\\u002Finstaller\\u002F23\.\d+_\w+\\u002FCinema4D-23\.\d+_Mac_Autoinstaller\.dmg)</string>
			<key>result_output_var_name</key>
			<string>url</string>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>input_string</key>
			<string>%url%</string>
			<key>string_to_replace</key>
			<string>\\u002F</string>
			<key>replacement_string</key>
			<string>/</string>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.commonprocessors/StringReplacer</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%output_string%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Maxon Cinema 4D Full Installer.app</string>
				<key>requirement</key>
				<string>identifier "net.maxon.cinema4d.installer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "4ZY22YGXQG"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Maxon Cinema 4D Full Installer.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
