<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Frame.io Transfer.</string>
	<key>Identifier</key>
	<string>com.github.hovedkvarteret.download.Frame.ioTransfer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Frame.io Transfer</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.frame.io/transfer</string>
				<key>result_output_var_name</key>
				<string>url</string>
				<key>re_pattern</key>
				<string>href=\"(https:\/\/transferapp\.frame\.io\/Frame\.io-Transfer\/[0-9a-f]{32}\/latest\/darwin\/x64\/Frame\.io\+Transfer\.dmg)</string>
				<key>curl_opts</key>
				<string></string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Frame.io Transfer.app</string>
				<key>requirement</key>
				<string>identifier "com.frameio.transfer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "6D429SHX3Y"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Frame.io Transfer.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
